export const CONFIG = {
    dev: false, // パーサーの動作がログされる
    attr: {
        indent: {
            toAll: {
                enable: true, // 階層深度に基づいたインデントを自動的にすべての要素に適応する
                override: false // 既存のすべてのindentアトリビュートに優越する
            },
            base: 30,
            unit: "px"
        }
    },
    leftIndent: {
        base: 20,
        unit: "px"
    }
};
export const RULE = `
{#{上昇気流に乗る日々}}{/:name=これは題名なのだ{
    {##{猫は見つけられるか}};
    その{e{いちごミルク}};は一語には収まら{b{ない}};だろう。なぜなら{e{{b{マツモトキヨシ}};}};のセールは自民党政権の大勝により
    品行方正のリードアルファに合格したからだ。したがって、また、ITパスポートにおけるピュレグミの摂取に関するクーポンは
    宇宙大図鑑の３６５ｐ北部の枕草子に記載されていることも判明しうる。これによって、さらに、爪切りに引っかかった人生の
    答えはラジオの外にある。高校入試までの時間はしばらくiPhoneSE10により牛耳られることとなるだろう。
    {##{野田スターリンは非情であるのだ}}{/{
        {i:height=200px,width=400px{https://media.discordapp.net/attachments/1342495236462481472/1471398319451279402/IMG_2377.jpg?ex=698ec9f8&is=698d7878&hm=b1daf5816fbd712707b7c970c6caa4f56848ceb8aab7da310316181e5200dcb7&=&format=webp&width=322&height=483}};
        このために、人類の準備は{e{{b{死}};}};にいたる病となり、ともに、iPadシリーズにおけるクリップの需要も高まっていく。カーテンレールは今や錆びついており、水道管工事はメガネケースと認識されかねないメモ帳となった。
        一方で、汚物創価学会について、青チャートが大学入試、共通テストにおいて９９．９９％の得点率をたたき出したことがルーメンになっている。
        その渦中にいるのが古語である。充電器は、ティッシュケースにおける影響力を日々増しており、虹色のキノコを破壊する勢いでない。
        {###{P.S.地上の最後の悪魔は汚い窓のすぐ外側にいるわけだ}}{/{
            場が凍り付いているということである。人類の主張の歴史の変遷において、灯台下暗し的となった集合知は、未だ真の敵を見つけられずにいるのだ。その根拠として、人類は銘々、
            終始他の個と戦っているかのような人生を送っている。現代は鋼鉄の枠に閉ざされた現ならざるものに取りつかれたのち自らを自ら失った愚かで哀れな時代であるということが、物理基礎により判明している。
            {###{終始絶望の連続だった}}{/{
                ああ、
            }};
        }};
    }};
    そう
    @elem@
    {##{その結果、通知はこちらを赦し給わない}}{/{
        愛くるしいことなのだ。いささかなるよわいの重なりよりずっと。グラファイトがフレームを掃除するかのようにである。だが、マウスは異なる。紙パックは優れていないし、赤ペンが結局代替たりうるわけであるからだ。
        その結果、完全に価値を失ってしまった美{e{容液は、メン}};ズエステにより最終的な運命付けをされた。許してください
    }};
    {##{希望的容器を見つけたのか}}{/{
        張り手によ{e{ってヒビが入ったペットボトルと{b{その顔に手をかざせ}};ば、微かな熱を感じる。スマートフォンにとっての私とは、常にシャープペンシルのペン先でし{b{かな}};いとい{b{う}};ことを、それは意味しているということを、今。
        もしこの赤シートへ、}};キノコ容器に入れられた星の砂が突入すれば。そのように感じたところで、意味のかけらも見つかることはなかったのである。
        レシートが頬を伝い次々と流れ落ちていく。したがって、次に、それはホウレンソウ畑に今は。強く根を張り枯れない！
        {##{あるいは、その中で}}{/{
            {i:height=300px,width=300px{https://media.discordapp.net/attachments/1342495236462481472/1471398320105717903/IMG_2379.jpg?ex=698ec9f8&is=698d7878&hm=d2b4afca5f9ad73f5cee0b8a2bd488bc02a3e6e7dd2d9068d3b1a0098cf19b44&=&format=webp&width=322&height=483}};
            フォルダに穴が開いている。水は流れ込んで{b{は出ていき、行き場の{e{ないスリランカはいまだ終わりを}};知るふうにも見えない。そのえんぴつが今にも折れそうになってしまっていても、あなたの目はいつでも窓の汚れを指示していた。
            きっと宇宙が枯れてしまっても、どこかの窓の汚れを見ているのだろう。この模試の予定が、ともすれば、もう、なくなってしまっていた可能性について考えれば、否、胸躍り血沸くのも必然であるということを、君は淡々と語ってくれたね。
            あるいは、{e{その中で、いや、また、もう、ティ}};ッシュの山に}};海を埋め終わるその日ももはや、拒むところではない。
        }};
    }};
    {##{そうです。戻れなくなってしまった}}{/{
        {i{https://media.discordapp.net/attachments/1342495236462481472/1471398320415969280/IMG_2381.jpg?ex=698ec9f8&is=698d7878&hm=41e32ee5e6b8245ce90d4077e6e926c8f31e526ac59ca1717060af80909201fe&=&format=webp&width=322&height=483}};
        溺れることだったのである。君は生きていてそうしているのです。つまり、すぐ外のお花畑から一本積んできて、近くで眺めていたんだよ。で、あるから、この文鎮のさびは水の中にあったせいではないのだ。それはもう、行く先のない塩素のせいだった、ってことなのか。
        あるいは、まあ、みんなの家にあるお札だったのかもしれない。そのネックレスもそうだったよね。いつもかく意味を成していたのだ。そこに置かれている教科書が、そんなにも懐かしいの？あ、単語帳だったか。
        そうです。戻れなくなってしまっていた、頭の中をすべて使い切って行ったそれは、瀬戸際の魔法のように、あっち側に物事を連れていく儀式と同じだったんだよね。だがしかし、その定説にとっての汚点は、その成功は定義において危ういというアシントロピカルファラシーだった。
        知ってる。として、なぜそれは今もあってあるのか、
    }};
    {##{これが、{e{こ{b{れ}};}};が、終わりを含有しているようには到底見えないが}}{/{
        大丈夫、100%{b{してる}};👍。もし不安だったら、{b{絶対大丈夫}};な、{b{最終確定のアレ}};、やってみる？・僕の正確なプログラムによって確実に当てる💛
        ・または、まだ不安か？
        {###{ふ}};
    }};
}};
~~~~
r:elem==
{##{価値ある日々を失くしてしまった}}{/{
    {i:height=300px,width=300px{https://media.discordapp.net/attachments/1342495236462481472/1471398319841607824/IMG_2378.jpg?ex=698ec9f8&is=698d7878&hm=92f47f30d01ebb3815c9136a8c41f06521bd1d8f6513ed3644b0c55d87c98627&=&format=webp&width=322&height=483}};
    きのこが冷蔵庫に張り付いているとみられる。退廃的なつたが日常生活において聖地巡礼に絡まっているようである。したがって、ガラス玉は輝きを失い、付随し、その下の掌の持ち主は心を奪われてしまったかのようである。
    そのファイルの最終章は、以下のような結末をたどる：地政学的宝石箱；コモンエアコンの枯渇、失われた哀れな時間の山を眺め過ちを思い知る、皮肉にもそれが戻ることはありえないのであり、残されたそれはもはや十分に少ないということだ。
    {##{一体なぜか？}}{/{
        如何なる最後も絶望的たりえないのである。一方で、あらゆる先がこれになるのであるが、しかし、まあ、知っての通り、無限時間後の自己の完璧な再現がこれである。そんな中、けん玉のペンの部分をそのタブレットケースに衝突をさせるということは、
        まったく些細なことでしかなく、気にするに完全に値しない哀れなものごとととらえることが可能である。
    }};  
}};
;;
s:css==
color: #f00;`;

/*
{#{前文}}{/{
    Lorem ipsum
}};
{#:name=aaa,color=red{第一条}}{/{
    @element2@
    {##:name="あああについて"{第一項}}{/{
        @depth@
        Lorem ipsum a adasd a sdasdsd sdsdad
        改行後
        {##{DDDD}};
        {###{AAABBB}};
        aadasdplp spldplasdplao okoskdoaskdoak soakdoask aosdko
    }};
}};
~~~~
s:name1==あああ規定;;
r:element1=={##{masakano}};
{##{
    MidasiA
}}{/{
    aaa
    {###{ACCD}};
    aaa
}};
;;
r:element2=={##{adssadasd}};
{##{
    MidashiB
}}{/{
    asdasd
    {###{cascas}};
    @element1@
}};
;;
*/
